import vectorize_JD_new
import vectorize_ONET_new
import process_vectorized_db
import check_processed_result

if __name__ == "__main__":
    print('------------------------------------------正在进行JD数据向量化------------------------------------------')
    vectorize_JD_new.JD_main()
    print('------------------------------------------JD数据向量化执行完毕！------------------------------------------')

    # print('------------------------------------------正在进行ONET数据向量化------------------------------------------')
    # vectorize_ONET_new.ONET_main()
    # print('------------------------------------------ONET数据向量化执行完毕！------------------------------------------')
    #
    # print('------------------------------------------正在计算JD数据与ONET数据距离------------------------------------------')
    # process_vectorized_db.vector_main()
    # print('------------------------------------------向量距离计算完毕！------------------------------------------')
    #
    # print('------------------------------------------正在利用GPT检查匹配结果------------------------------------------')
    # check_processed_result.check_main()
    # print('------------------------------------------GPT检查完毕！------------------------------------------')
